import {ScrollView, Text, View} from 'react-native';

import DrawerHeader from '../../components/UI/DrawerHeader';

const Confidential = ({navigation}) => {
  return (
    <View>
      <DrawerHeader navigation={navigation} />
      <ScrollView style={{paddingHorizontal: 12}}>
        <Text style={{fontSize: 12, color: '#000', lineHeight: 16}}>
          Lorem Ipsum საბეჭდიდატიპოგრაფიული ინდუსტრიისუშინაარსოტექსტია. იგი
          სტანდარტად 1500-იანიწლებიდანიქცა, როდესაც
          უცნობმამბეჭდავმაამწყობდაზგაზე წიგნისსაცდელიეგზემპლარიდაბეჭდა. მისი
          ტექსტიარამარტო 5 საუკუნისმანძილზეშემორჩა, არამედმანდღემდე, ელექტრონული
          ტიპოგრაფიისდრომდეცუცვლელად მოაღწია. განსაკუთრებულიპოპულარობამას 1960-
          იანწლებშიგამოსულმა Letraset-ისცნობილმა ტრაფარეტებმამოუტანა,
          უფრომოგვიანებითკი — Aldus PageMaker-ის ტიპისსაგამომცემლოპროგრამებმა,
          რომლებშიც Lorem Ipsum-ისსხვადასხვავერსიებიიყო ჩაშენებული.
          ცნობილიფაქტია, რომგვერდის წაკითხვადშიგთავსსშეუძლია
          მკითხველისყურადღებამიიზიდოსდადიზაინის აღქმაშიხელიშეუშალოს. Lorem
          Ipsum-ის გამოყენებითვღებულობთიმაზემეტ-ნაკლებად სწორიგადანაწილების
          ტექსტს, ვიდრეერთიდაიგივეგამეორებადი სიტყვებიახოლმე. შედეგად,
          ტექსტიჩვეულებრივ ინგლისურსგავს, მისიწაითხვაკიშეუძლებელია. დღესუამრავი
          პერსონალურისაგამომცემლოპროგრამადა ვებგვერდიიყენებს Lorem Ipsum-ს,
          როგორც დროებითტექსტსწყობისშესავსებად; Lorem
          Ipsum-ისმოძებნისასკისაძიებო სისტემებიბევრდაუსრულებელგვერდს
          გვიჩვენებენ. წლებისმანძილზეამტექსტის უამრავივერსიაგამოჩნდა,
          ზოგიშემთხვევით დაშვებულიშეცდომისგამო, ზოგი კი — განზრახ, ხუმრობით.
          Lorem Ipsum საბეჭდიდატიპოგრაფიული ინდუსტრიისუშინაარსოტექსტია. იგი
          სტანდარტად 1500-იანიწლებიდანიქცა, როდესაც
          უცნობმამბეჭდავმაამწყობდაზგაზე წიგნისსაცდელიეგზემპლარიდაბეჭდა. მისი
          ტექსტიარამარტო 5 საუკუნისმანძილზეშემორჩა, არამედმანდღემდე, ელექტრონული
          ტიპოგრაფიისდრომდეცუცვლელად მოაღწია. განსაკუთრებულიპოპულარობამას 1960-
          იანწლებშიგამოსულმა Letraset-ისცნობილმა ტრაფარეტებმამოუტანა,
          უფრომოგვიანებითკი — Aldus PageMaker-ის ტიპისსაგამომცემლოპროგრამებმა,
          რომლებშიც Lorem Ipsum-ისსხვადასხვავერსიებიიყო ჩაშენებული.
          ცნობილიფაქტია, რომგვერდის წაკითხვადშიგთავსსშეუძლია
          მკითხველისყურადღებამიიზიდოსდადიზაინის აღქმაშიხელიშეუშალოს. Lorem
          Ipsum-ის გამოყენებითვღებულობთიმაზემეტ-ნაკლებად სწორიგადანაწილების
          ტექსტს, ვიდრეერთიდაიგივეგამეორებადი სიტყვებიახოლმე. შედეგად,
          ტექსტიჩვეულებრივ ინგლისურსგავს, მისიწაითხვაკიშეუძლებელია. დღესუამრავი
          პერსონალურისაგამომცემლოპროგრამადა ვებგვერდიიყენებს Lorem Ipsum-ს,
          როგორც დროებითტექსტსწყობისშესავსებად; Lorem
          Ipsum-ისმოძებნისასკისაძიებო სისტემებიბევრდაუსრულებელგვერდს
          გვიჩვენებენ. წლებისმანძილზეამტექსტის უამრავივერსიაგამოჩნდა,
          ზოგიშემთხვევით დაშვებულიშეცდომისგამო, ზოგი კი — განზრახ, ხუმრობით.
        </Text>
      </ScrollView>
    </View>
  );
};

export default Confidential;
